index.org
#+HUGO_BASE_DIR: ./
#+HUGO_SECTION: posts

#+AUTHOR: Tom Purl

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

** Media Log                                             :podcasts:tv:movies:
   :PROPERTIES:
   :EXPORT_FILE_NAME: Media_Log
   :EXPORT_DATE: 10/19/2019
   :EXPORT_HUGO_MENU: :menu "fun"
   :EXPORT_HUGO_SECTION: fun
   :END:
*** Explanation

    I share this stuff because all of the cool kids are doing it 😁

    No really, [[https://tinyletter.com/jenmyers/letters/the-difficult-i-ll-do-right-now-the-impossible-will-take-a-little-while][a lot of people I admire]] keep a public log of all of the
    media they consume, so I thought I might like it too.

*** 2019
**** January
***** 1
****** Gravity Falls, season 2                                           :tv:
***** 12
****** Incredibles 2                                                  :movie:
***** 19
****** Strange Brew                                           :movie:rewatch:
***** 20
****** Back to the future                                     :rewatch:movie:
****** Gamera - MST3K                                                 :movie:
***** 21
****** Gamera vs. Zigra - MST3K                                       :movie:
***** 26
****** Gamera vs Guiron - MST3K                               :rewatch:movie:
****** Hellboy Omnibus Volume 1                                        :book:
***** 27
****** The Pumaman - MST3K                                            :movie:
**** February
***** 3
****** The Amazing Colossal Man/War Of the Colossal Beast - MST3K     :movie:
***** 5
****** Sorry to bother you                                            :movie:
***** 6
****** Doug Stanhope - no place like home                    :comedy:rewatch:
***** 7
****** Last podcast on the left - Josef Mengele series              :podcast:
****** Kyle Kinane - death of the party                      :comedy:rewatch:
***** 9
****** Sturgil Simpson - metamodern sounds in country music   :music:rewatch:
****** Gravity falls, season 2                                   :tv:rewatch:
****** Gravity falls, season 1                                   :rewatch:tv:
***** 17
****** The indestructible man - MST3K                                 :movie:
**** March
***** 1
****** Dana Gould Hour: Potty Mouthery                              :podcast:
****** Brains On: How to cook for an alien                          :podcast:
***** 3
****** Brains On: Boogers and sun sneezes                           :podcast:
***** 5
****** Hot dog taste test                                              :book:
***** 8
****** Say Hi - the wishes and the glitch                     :music:rewatch:
***** 13
****** Baltimore vol 1: the Plague ships                               :book:
***** 23
****** Green River Killer: A True Detective Story                      :book:
***** 26
****** Rise of the black flame                                         :book:
**** April
***** 12
****** Archer - season 9                                                 :tv:
***** 18
****** Preacher - Volume 1                                             :book:
***** 25
****** The Damned United                                              :movie:
**** May
***** 3
****** Shazam!                                                        :movie:
**** August
***** 24
****** Once upon a time in Hollywood                                  :movie:
**** September
***** 19
****** Le Samouraï                                                    :movie:
***** 27
****** Captain America                                                :movie:
***** 28
****** Captain Marvel                                                 :movie:
**** October
***** 7
****** The Last Podcast On The Left - Mormonism Series              :podcast:
***** 12
****** Bill and Ted's Excellent Adventure                     :rewatch:movie:
***** 23
****** Last Podcast on the Left - Men in Black Series       :rewatch:podcast:
***** 24
****** Carnival of Souls                                              :movie:
****** Mulholland Drive                                       :rewatch:movie:
***** 25
****** Freaks                                                 :movie:rewatch:
**** November
***** 1
****** MST3K: Bride of the Monster                                    :movie:
