content/bd/Media_Log.md
+++
title = "Media Log"
author = ["Tom Purl"]
lastmod = 2019-10-21T12:20:20-05:00
tags = ["podcasts", "tv", "movies"]
categories = ["fun"]
weight = 2001
draft = false
[menu.braindump]
  weight = 2001
  identifier = "media-log"
+++

## Explanation {#explanation}

I share this stuff because all of the cool kids are doing it 😁

No really, [a lot of people I admire](https://tinyletter.com/jenmyers/letters/the-difficult-i-ll-do-right-now-the-impossible-will-take-a-little-while) keep a public log of all of the
media they consume, so I thought I might like it too.


## 2019 {#2019}


### January {#january}


#### 1 {#1}

-   Gravity Falls, season 2     :tv:


#### 12 {#12}

-   Incredibles 2     :movie:


#### 19 {#19}

-   Strange Brew     :movie:rewatch:


#### 20 {#20}

-   Back to the future     :rewatch:movie:

-   Gamera - MST3K     :movie:


#### 21 {#21}

-   Gamera vs. Zigra - MST3K     :movie:


#### 26 {#26}

-   Gamera vs Guiron - MST3K     :rewatch:movie:

-   Hellboy Omnibus Volume 1     :book:


#### 27 {#27}

-   The Pumaman - MST3K     :movie:


### February {#february}


#### 3 {#3}

-   The Amazing Colossal Man/War Of the Colossal Beast - MST3K     :movie:


#### 5 {#5}

-   Sorry to bother you     :movie:


#### 6 {#6}

-   Doug Stanhope - no place like home     :comedy:rewatch:


#### 7 {#7}

-   Last podcast on the left - Josef Mengele series     :podcast:

-   Kyle Kinane - death of the party     :comedy:rewatch:


#### 9 {#9}

-   Sturgil Simpson - metamodern sounds in country music     :music:rewatch:

-   Gravity falls, season 2     :tv:rewatch:

-   Gravity falls, season 1     :rewatch:tv:


#### 17 {#17}

-   The indestructible man - MST3K     :movie:


### March {#march}


#### 1 {#1}

-   Dana Gould Hour: Potty Mouthery     :podcast:

-   Brains On: How to cook for an alien     :podcast:


#### 3 {#3}

-   Brains On: Boogers and sun sneezes     :podcast:


#### 5 {#5}

-   Hot dog taste test     :book:


#### 8 {#8}

-   Say Hi - the wishes and the glitch     :music:rewatch:


#### 13 {#13}

-   Baltimore vol 1: the Plague ships     :book:


#### 23 {#23}

-   Green River Killer: A True Detective Story     :book:


#### 26 {#26}

-   Rise of the black flame     :book:


### April {#april}


#### 12 {#12}

-   Archer - season 9     :tv:


#### 18 {#18}

-   Preacher - Volume 1     :book:


#### 25 {#25}

-   The Damned United     :movie:


### May {#may}


#### 3 {#3}

-   Shazam!     :movie:


### August {#august}


#### 24 {#24}

-   Once upon a time in Hollywood     :movie:


### September {#september}


#### 19 {#19}

-   Le Samouraï     :movie:


#### 27 {#27}

-   Captain America     :movie:


#### 28 {#28}

-   Captain Marvel     :movie:


### October {#october}


#### 7 {#7}

-   The Last Podcast On The Left - Mormonism Series     :podcast:


#### 12 {#12}

-   Bill and Ted's Excellent Adventure     :rewatch:movie:
